
//
//  AIRBRTCConfig.h
//  AliInteractiveRoomBundle
//
//  Created by 刘再勇 on 2021/8/19.
//  Copyright © 2021 AliYun. All rights reserved.
//

#import <Foundation/Foundation.h>
#import <UIKit/UIKit.h>
#import <AliInteractiveRoomBundle/AIRBCommonDefines.h>

NS_ASSUME_NONNULL_BEGIN

@interface AIRBRTCConfig : NSObject

/**
 * 是否开启纯音频模式，默认为NO（关闭）
 * - YES: 只有音频推流和拉流（纯音频）
 * - NO: 音视频都支持
 * @note 需要在joinChannel之前配置
 */
@property (nonatomic, assign) BOOL audioOnlyModeEnabled;

/**
 * 高分辨率视频流(大流)的编码分辨率，默认为640x480
 */
@property (nonatomic, assign) CGSize videoStreamTypeHighDimensions;

/**
 * 高分辨率视频流(大流)的编码帧率，默认为15, 最大为30
 */
@property (nonatomic, assign) NSInteger videoStreamTypeHighFrameRate;

/**
 * 高分辨率视频流(大流)的编码码率(Kbps)
 * 默认为0，表示由SDK内部根据视频分辨率和帧率计算合适的编码码率
 * @note 码率设置根据分辨率和帧率有对应的合理范围，该值设置在合理范围内有效，否则SDK会自动调节码率到有效值。以下码表列举常见的分辨率、帧率对应的编码码率设置的区间:

  | 分辨率              | 帧率(fps)   | 最小码率 (Kbps)      | 推荐码率(Kbps)      |最大码率(Kbps)
  |--------------------- |--------------|----------------------------|---------------------------|---------------------
  | 120 * 120              | 5                 | 10                       | 25                            | 75
  | 120 * 120              | 10               | 17                       | 50                            | 150
  | 120 * 120              | 15               | 25                       | 70                            | 210
  | 120 * 120              | 20               | 34                       | 90                            | 270
  | 120 * 120              | 30               | 50                       | 115                          | 345
  | 160 * 120              | 5                 | 10                       | 30                            | 90
  | 160 * 120              | 10               | 20                       | 55                            | 165
  | 160 * 120              | 15               | 30                       | 80                            | 240
  | 160 * 120              | 20               | 40                       | 100                          | 300
  | 160 * 120              | 30               | 60                       | 130                          | 390
  | 180 * 180              | 5                 | 10                       | 50                            | 150
  | 180 * 180              | 10               | 17                       | 70                            | 210
  | 180 * 180              | 15               | 26                       | 100                          | 300
  | 180 * 180              | 20               | 34                       | 130                          | 390
  | 180 * 180              | 30               | 51                       | 180                          | 540
  | 240 * 180              | 5                 | 15                       | 60                            | 180
  | 240 * 180              | 10               | 30                       | 90                            | 270
  | 240 * 180              | 15               | 45                       | 130                          | 390
  | 240 * 180              | 20               | 60                       | 165                          | 495
  | 240 * 180              | 30               | 90                       | 230                          | 690
  | 320 * 180              | 5                 | 15                       | 65                            | 195
  | 320 * 180              | 10               | 30                       | 110                          | 330
  | 320 * 180              | 15               | 45                       | 170                          | 510
  | 320 * 180              | 20               | 60                       | 220                          | 660
  | 320 * 180              | 30               | 90                       | 300                          | 900
  | 240 * 240              | 5                 | 15                       | 70                            | 140
  | 240 * 240              | 10               | 30                       | 100                          | 200
  | 240 * 240              | 15               | 45                       | 150                          | 300
  | 240 * 240              | 20               | 60                       | 200                          | 400
  | 240 * 240              | 30               | 90                       | 256                          | 512
  | 320 * 240              | 5                 | 20                       | 100                          | 200
  | 320 * 240              | 10               | 40                       | 170                          | 340
  | 320 * 240              | 15               | 60                       | 256                          | 512
  | 320 * 240              | 20               | 80                       | 320                          | 640
  | 320 * 240              | 30               | 120                     | 400                          | 800
  | 424 * 240              | 5                 | 26                       | 100                          | 200
  | 424 * 240              | 10               | 53                       | 170                          | 340
  | 424 * 240              | 15               | 79                       | 260                          | 520
  | 424 * 240              | 20               | 105                     | 340                          | 680
  | 424 * 240              | 30               | 158                     | 430                          | 860
  | 360 * 360              | 5                 | 30                       | 120                          | 240
  | 360 * 360              | 10               | 60                       | 180                          | 360
  | 360 * 360              | 15               | 90                       | 260                          | 520
  | 360 * 360              | 20               | 120                     | 330                          | 660
  | 360 * 360              | 30               | 180                     | 400                          | 800
  | 480 * 360              | 5                 | 40                       | 150                          | 300
  | 480 * 360              | 10               | 80                       | 240                          | 480
  | 480 * 360              | 15               | 120                     | 350                          | 700
  | 480 * 360              | 20               | 160                     | 430                          | 860
  | 480 * 360              | 30               | 240                     | 512                          | 1024
  | 640 * 360              | 5                 | 83                       | 200                          | 400
  | 640 * 360              | 10               | 165                     | 340                          | 680
  | 640 * 360              | 15               | 248                     | 512                          | 1024
  | 640 * 360              | 20               | 330                     | 600                          | 1200
  | 640 * 360              | 30               | 495                     | 700                          | 1400
  | 480 * 480              | 5                 | 83                       | 170                          | 340
  | 480 * 480              | 10               | 165                     | 260                          | 520
  | 480 * 480              | 15               | 248                     | 400                          | 800
  | 480 * 480              | 20               | 330                     | 470                          | 940
  | 480 * 480              | 30               | 495                     | 600                          | 1200
  | 640 * 480              | 5                 | 110                     | 200                          | 400
  | 640 * 480              | 10               | 220                     | 350                          | 700
  | 640 * 480              | 15               | 330                     | 512                          | 1024
  | 640 * 480              | 20               | 440                     | 600                          | 1200
  | 640 * 480              | 30               | 660                     | 700                          | 1400
  | 840 * 480              | 5                 | 180                     | 256                          | 512
  | 840 * 480              | 10               | 360                     | 512                          | 1024
  | 840 * 480              | 15               | 540                     | 610                          | 1220
  | 840 * 480              | 20               | 720                     | 800                          | 1600
  | 840 * 480              | 30               | 1080                   | 930                          | 1860
  | 960 * 720              | 5                 | 250                     | 250                          | 600
  | 960 * 720              | 10               | 500                     | 500                          | 750
  | 960 * 720              | 15               | 750                     | 750                          | 1125
  | 960 * 720              | 20               | 1000                   | 1000                        | 1500
  | 960 * 720              | 30               | 1500                   | 1500                        | 2250
  | 1280 * 720            | 5                 | 400                     | 400                          | 600
  | 1280 * 720            | 10               | 800                     | 800                          | 1200
  | 1280 * 720            | 15               | 1200                   | 1200                        | 1800
  | 1280 * 720            | 20               | 1600                   | 1600                        | 2400
  | 1280 * 720            | 30               | 2400                   | 2400                        | 3600
  | 1920 * 1080          | 5                 | 500                     | 500                          | 750
  | 1920 * 1080          | 10               | 1000                   | 1000                        | 1500
  | 1920 * 1080          | 15               | 1500                   | 1500                        | 2250
  | 1920 * 1080          | 20               | 2000                   | 2000                        | 3000
  | 1920 * 1080          | 30               | 3000                   | 3000                        | 4500
 */
@property (nonatomic, assign) NSInteger videoStreamTypeHighBitrate;

/**
 * 是否同时推送低分辨率视频流(小流)，默认开启(小流的分辨率无法修改)
 */
@property (nonatomic, assign) BOOL videoStreamTypeLowPublished;

//******** 已废弃，请通过开启旁路推流接口startPublishingBypassLive:进行设置 ********//
///**
// * 旁路直播分辨率类型，默认值为AIRBRTCBypassLiveResolutionType_1280x720
// * @note 非必需，只有开启旁路直播的房主设置才会生效
// */
//@property (nonatomic, assign) AIRBRTCBypassLiveResolutionType bypassLiveResolutionType;

@end

NS_ASSUME_NONNULL_END
